사전이나 Series를 사용하는 것에 비해 파이썬 함수를 사용해서 그룹을 매핑하는 것은 좀더 독창적이며 추상적인 방법이다.<br/>
그룹 색인으로 넘기 함수는 색인 값 하나마다 한번씩 호출되며, 반환 값은 그 그룹의 이름으로 사용된다.<br/>
좀 더 구체적으로 말하자면 아까 살펴본 예제에서 people DataFrame은 사람의 이름을 색인 값으로 사용했다.<br/>
만약에 이름의 길이별로 그룹을 묶고 싶다면 이름의 길이가 담긴 배열을 만들어 넘기는 대신 `len` 함수를 넘기면 된다.

In [1]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns=['a','b','c','d','e'],
                     index=['joe','steve','wes','jim','travis'])

In [10]:
people

               a         b         c         d         e
joe    -0.658694  2.522566 -0.757305 -0.815266 -0.628301
steve  -0.081959 -0.440453 -1.097713 -0.507171 -2.033868
wes    -0.878685 -0.714267  1.619498 -0.014278  0.564160
jim     1.443217 -0.045922 -2.114174 -0.508116  0.081833
travis  0.616686 -0.284065  0.417822 -0.242052 -0.568512

In [3]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.094163  1.762378 -1.251980 -1.337660  0.017692
5 -0.081959 -0.440453 -1.097713 -0.507171 -2.033868
6  0.616686 -0.284065  0.417822 -0.242052 -0.568512

In [4]:
key_list = ['one','one','one','two','two']

In [14]:
people.groupby(len).min()

          a         b         c         d         e
3 -0.878685 -0.714267 -2.114174 -0.815266 -0.628301
5 -0.081959 -0.440453 -1.097713 -0.507171 -2.033868
6  0.616686 -0.284065  0.417822 -0.242052 -0.568512

In [15]:
people.groupby(key_list).min()

            a         b         c         d         e
one -0.878685 -0.714267 -1.097713 -0.815266 -2.033868
two  0.616686 -0.284065 -2.114174 -0.508116 -0.568512

In [9]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -0.878685 -0.714267 -0.757305 -0.815266 -0.628301
  two  1.443217 -0.045922 -2.114174 -0.508116  0.081833
5 one -0.081959 -0.440453 -1.097713 -0.507171 -2.033868
6 two  0.616686 -0.284065  0.417822 -0.242052 -0.568512

In [8]:
people.groupby([key_list]).min()

            a         b         c         d         e
one -0.878685 -0.714267 -1.097713 -0.815266 -2.033868
two  0.616686 -0.284065 -2.114174 -0.508116 -0.568512